{"data":{"site":{"siteMetadata":{"title":"@nicoespeon's blog","subtitles":{"en":"I write about web development, agile practices and personal organization.","fr":"J’écris sur le développement web, les pratiques agiles et l’organisation personnelle."},"author":{"name":"Nicolas Carlo","twitter":"nicoespeon"},"disqusShortname":"nicoespeon","url":"https://www.nicoespeon.com"}},"markdownRemark":{"id":"073940f3-e039-5162-b4b0-a5ecf7667a1e","html":"<p>Today is Friday. And not any Friday, but the end of our 2-weeks Sprint. End of the Sprint means demos, but also a ceremony that I really like: Sprint Retrospective.</p>\n<p>Whatever is your process, the core thing of Agile is to reduce the feedback loop. Having a recurring ceremony when people pause and reflect on how things went during the last few days is really valuable. It gives time to all of us to share our thoughts and feelings. We give feedback to others about how we operate as a team, and how we could do better. As the team grows in maturity, this feedback will be part of daily work. Still, having a recurring ceremony is really valuable as it helps us to step back and reflect.</p>\n<p>At Busbud, we usually do retrospective using an online board. It’s a typical <a href=\"https://www.mountaingoatsoftware.com/blog/a-simple-way-to-run-a-sprint-retrospective\">“Start, Stop, Continue”</a> (SSC) board, with a column for “Next Actions”. I think the best part of it is that people can participate, even when they are not at the office—it’s really common for us to work from home when we need to. One would also argue that people can add items to the retrospective board at any time, so they don’t forget about something important they would like to share. But experience has shown me this doesn’t work in practice. People work, they forget about the retrospective until we effectively meet. If something is really important, they would recall.</p>\n<p>But today was different!</p>\n<p>Today, the meeting room was taken for unexpected, important reasons. So we didn’t have a place to regroup. That’s when I suggested <strong>to do the retrospective offline</strong>—nobody was remote anyway.</p>\n<p>So we went to our big whiteboard. We bring the post-its, the markers and we stood up in half-circle around the whiteboard. We did a SSC and even a <a href=\"http://www.funretrospectives.com/happiness-radar/\">Mood Meter</a> roundtable.</p>\n<blockquote>\n<p>It. Was. Efficient.</p>\n</blockquote>\n<p>I remember retrospective meetings where we usually meet around a table. We’ll bring our laptops because, you know, we need to put our items in the online board. And I always get this feeling at some point that it’s more about the process than the content. We usually get some discussions, but it’s always the same people talking—me, definitely included.</p>\n<p>Being all here, standing up and writing on post-its was <strong>much more engaging</strong>! Everybody was clearly involved in the retrospective. Everybody was here and present. We had really insightful exchanges, and we took very interesting “Next Actions”. I asked for feedback at the end of the session, and the team quite liked the offline format.</p>\n<p>Sometimes, convenient tools can play against the meaning of the ceremony. Dropping the tool turned to unleash the potential of our retrospective. I have this feeling we may have found a better way of working, as a team. I’m looking forward in 2 weeks, to see how it goes.</p>\n<p><strong>And you, are you using an online tool for your retrospectives?</strong></p>","fields":{"tagSlugs":["/tags/til/","/tags/retrospective/"],"slug":"/en/2019/01/til-online-tools-can-hurt-agile/"},"timeToRead":2,"frontmatter":{"title":"TIL: Tools can limit the potential of agile ceremonies","tags":["til","retrospective"],"date":"2019-01-16T00:00:00.000Z","description":"Today, I realized how not using an online tool could improve team engagement in a ceremony."}}},"pageContext":{"slug":"/en/2019/01/til-online-tools-can-hurt-agile/"}}